performance_benchmarks/results/gunicorn_wsgi_results.txt
Running 1m test @ http://localhost:5000
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.28ms  416.74us  21.85ms   80.47%
    Req/Sec   787.85     50.88   848.00     40.29%
  Latency Distribution
     50%   15.25ms
     75%   15.49ms
     90%   15.76ms
     99%   16.55ms
  376562 requests in 1.00m, 61.05MB read
Requests/sec:   6272.00
Transfer/sec:      1.02MB